Revit 2015 API
AnnotationSymbol Properties
The AnnotationSymbol type exposes the following members.
Properties
Name | Description
AnnotationSymbolType
 The AnnotationSymbol style of this AnnotationSymbol.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanFlipFacing
Property to test whether the orientation of family instance facing can be flipped.
 (Inherited from FamilyInstance.)
CanFlipHand
Property to test whether the orientation of family instance hand can be flipped.
 (Inherited from FamilyInstance.)
CanFlipWorkPlane
Identifies if the instance can flip its work plane.
 (Inherited from FamilyInstance.)
CanRotate
Property to test whether the family instance can be rotated by 180 degrees.
 (Inherited from FamilyInstance.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
ExtensionUtility
Property to check whether the instance can be extended and return the interface for extension operation.
 (Inherited from FamilyInstance.)
FacingFlipped
Property to test whether the orientation of family instance facing is flipped.
 (Inherited from FamilyInstance.)
FacingOrientation
Property to get the orientation of family instance facing.
 (Inherited from FamilyInstance.)
FromRoom
The "From Room" set for the door or window in the last phase of the project.
 (Inherited from FamilyInstance.)
FromRoom[Phase] |  (Inherited from FamilyInstance.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HandFlipped
Property to test whether the orientation of family instance hand is flipped.
 (Inherited from FamilyInstance.)
HandOrientation
Property to get the orientation of family instance hand.
 (Inherited from FamilyInstance.)
Host
If the instance is contained within another element, this property returns the containing element. An instance that is face hosted will return the element containing the face.
 (Inherited from FamilyInstance.)
HostFace
Property to get the reference to the host face of family instance.
 (Inherited from FamilyInstance.)
HostParameter
If the instance is hosted by a wall, this property returns the parameter value of the insertion point of the instance along the wall's location curve.
 (Inherited from FamilyInstance.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
Invisible
Property to test whether the family instance is invisible.
 (Inherited from FamilyInstance.)
IsSlantedColumn
 Indicates if the family instance is a slanted column.
 (Inherited from FamilyInstance.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
IsWorkPlaneFlipped
Identifies if the instance's work plane is flipped.
 (Inherited from FamilyInstance.)
Leaders
Get all the leaders of this annotation symbol.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an instance within project.
 (Inherited from FamilyInstance.)
MEPModel
Retrieves the MEP model for the family instance.
 (Inherited from FamilyInstance.)
Mirrored
Property to test whether the family instance is mirrored. (only one axis is flipped)
 (Inherited from FamilyInstance.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[String]
Retrieves a parameter from the element given its name.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
Room
The room in which the instance is located (during the last phase of the project).
 (Inherited from FamilyInstance.)
Room[Phase] |  (Inherited from FamilyInstance.)
Space
The space in which the instance is located (during the last phase of the project).
 (Inherited from FamilyInstance.)
Space[Phase] |  (Inherited from FamilyInstance.)
StructuralMaterialId
Identifies the material that defines the instance's structural analysis properties.
 (Inherited from FamilyInstance.)
StructuralMaterialType
This property returns the physical material from which the instance is made.
 (Inherited from FamilyInstance.)
StructuralType
Provides the primary structural type of the instance, such as beam or column etc.
 (Inherited from FamilyInstance.)
StructuralUsage
Provides the primary structural usage of the instance, such as brace, girder etc.
 (Inherited from FamilyInstance.)
SuperComponent
Property to get the super component of current family instance.
 (Inherited from FamilyInstance.)
Symbol
Returns or changes the FamilySymbol object that represents the type of the instance.
 (Inherited from FamilyInstance.)
ToRoom
The "To Room" set for the door or window in the last phase of the project.
 (Inherited from FamilyInstance.)
ToRoom[Phase] |  (Inherited from FamilyInstance.)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace